### 연습문제 

1. 타이타닉 데이터에서 승객의 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive)인원수를 구하시오.

2. 성별 인원수는 인덱스 기준으로 정렬하고, 나이별 인원수는 값 기준으로 정렬하며, 나머지는 임의 기준으로 선정하여 정렬 하시오.

In [1]:
import numpy as np
import pandas as pd

In [2]:
# 설정 변경 코드
# 변수 명이 두번 이상 출력되어도 모두 콘솔에서 보여줄 것
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

# InteractiveShell.ast_node_interactivity : 'all' | 'last' | 'last_expr' | 'none' (기본값은 'last_expr')

In [3]:
# 타이타닉 승객 dataset 읽어오기
import seaborn as sns 
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [5]:
# 타이타닉 승객에 대하여 성별 인원수 구하기
titanic['sex'].value_counts().sort_index()

female    314
male      577
Name: sex, dtype: int64

In [6]:
# 타이타닉 승객에 대하여 나이별 인원수 구하기
titanic['age'].value_counts().sort_values()

0.42      1
20.50     1
24.50     1
0.67      1
14.50     1
         ..
30.00    25
19.00    25
18.00    26
22.00    27
24.00    30
Name: age, Length: 88, dtype: int64

In [7]:
# 타이타닉 승객에 대하여 선실별 인원수 구하기
#파이썬에서는 형태 분류 class로 작업
titanic['class'].value_counts().sort_values(ascending=True)

Second    184
First     216
Third     491
Name: class, dtype: int64

In [8]:
#타이타닉 승객에 대하여 사망/생존 인원수 구하기
titanic['alive'].value_counts().sort_index(ascending=False)

yes    342
no     549
Name: alive, dtype: int64

In [9]:
#타이타닉 승객에 대하여 사망/생존 인원수 구하기
#.연산자 이용해서 data에 접근
titanic.alive.value_counts().sort_index(ascending=False)

yes    342
no     549
Name: alive, dtype: int64

### 연습문제 : 수치형-> 범주형 데이터 생성

: 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고(alive), 각 그룹에 대해 미성년자, 청년, 중년, 장년, 노년 승객의 비율을 구하시오.

- bins=[1,15,25,35,60,99]
- labels=['미성년자','청년','중년','장년','노년']
- 각 그룹별 비유의 전체 합은 1이 되어야 한다.

In [10]:
# Warning 표시 안하도록 설정
import warnings
warnings.filterwarnings('ignore')

**타이타닉 데이터셋 로딩**

In [11]:
# 타이타닉 승객 dataset 읽어오기
import seaborn as sns 
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

**데이터 셋 분리 : 생존자 그룹과 사망자 그룹**

In [12]:
# 사망자 그룹 데이터 프레임 추출
dfNo = titanic[titanic['alive'] == 'no']

In [13]:
# 생존자 그룹 데이터 프레임 추출
dfYes = titanic[titanic['alive'] == 'yes']

**데이터 범위 설정**

In [14]:
# 라벨과 범위 간격 설정
bins = [1, 15, 25, 35, 60, 99]
labels=['미성년자','청년','중년','장년','노년']

In [15]:
# 범위 유효성 검사
# bins=[1,15,25,35,60,99]
titanic['age'].min()
#제시된 bins의 최초값 1 이하인 값 1.0과 0.42가 각
#그룹의 최소나이로 확인되므로 bins 수정
#최대나이는 74와 80으로 확인되어서 수정 필요 없음
bins[0] = 0
bins

0.42

[0, 15, 25, 35, 60, 99]

**범주형 데이터 생성**

In [16]:
# 카테고리 데이터 생성
catYes = pd.cut(dfYes['age'], bins, labels=labels) # 생존자
catNo = pd.cut(dfNo['age'], bins, labels=labels) # 사망자

**범주형 데이터 확인**

In [17]:
#카테고리 데이터 확인
catYes
catNo

1        장년
2        중년
3        중년
8        중년
9      미성년자
       ...
875    미성년자
879      장년
880      청년
887      청년
889      중년
Name: age, Length: 342, dtype: category
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

0        청년
4        중년
5       NaN
6        장년
7      미성년자
       ...
884      청년
885      장년
886      중년
888     NaN
890      중년
Name: age, Length: 549, dtype: category
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

**범주형 데이터 빈도 계산**

- 사망자 그룹

In [18]:
# 카테고리 데이터들의 빈도 수 계산
catNo.value_counts()

# 사망자그룹 계산
catNo.count()

# 각 연령대별 승객수의 비율 계산
catNo.value_counts(normalize=True)

# 전체 비율의 합 계산
catNo.value_counts(normalize=True).sum()

청년      143
장년      117
중년      113
미성년자     34
노년       17
Name: age, dtype: int64

424

청년      0.337264
장년      0.275943
중년      0.266509
미성년자    0.080189
노년      0.040094
Name: age, dtype: float64

1.0

* 생존자 그룹

In [19]:
# 카테고리 데이터들의 빈도 수 계산
catYes.value_counts()

# 생존자그룹 계산
catYes.count()

# 각 연령대별 승객수의 비율 계산
catYes.value_counts(normalize=True)

# 전체 비율의 합 계산
catYes.value_counts(normalize=True).sum()

중년      83
장년      78
청년      75
미성년자    49
노년       5
Name: age, dtype: int64

290

중년      0.286207
장년      0.268966
청년      0.258621
미성년자    0.168966
노년      0.017241
Name: age, dtype: float64

1.0